---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayPresetIndex
source: html/5b0d01ea-5be3-ef0e-2062-dd979a4e6e2a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayPresetIndex Property

"Single day presets combo"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudySingledayPresetIndex { get; }
```